siade/spec/fixtures/payloads/ants/found_siv_composed_name.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope
	xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\">
	<soapenv:Body>
		<siv:rep_consulter_dossier
			xmlns:siv=\"http://siv.mi.fr/DefinitionsServices/2007-06\">\n
			<siv:control>\n
				<siv:code_partenaire>ants_siv_code_partenaire</siv:code_partenaire>\n
				<siv:code_miat>ants_siv_code_miat</siv:code_miat>\n
				<siv:date_envoi>2024-03-12T10:30:15+01:00</siv:date_envoi>\n
				<siv:type_operation>Consultation Dossier</siv:type_operation>\n
				<siv:numero_session>rnd_a12cd3ef-d456-7890-e12f-345ab67890cd</siv:numero_session>\n
				<siv:code_traitement>0</siv:code_traitement>\n
				<siv:code_operation>1357924680</siv:code_operation>\n
				<siv:date_reception>2024-03-12T11:30:16+01:00</siv:date_reception>\n
				<siv:type_fichier_joint>xml</siv:type_fichier_joint>\n
			</siv:control>\n
			<siv:reponse>\n
				<siv:dossier>\n
					<siv:immatriculation>\n
						<siv:num_immat>AB-123-CD</siv:num_immat>\n
						<siv:date_prem_immat>2020-03-15</siv:date_prem_immat>\n
						<siv:date_att_immat>2020-03-15</siv:date_att_immat>\n
						<siv:code_type_immat>N</siv:code_type_immat>\n
						<siv:libelle_type_immat>Normale</siv:libelle_type_immat>\n
					</siv:immatriculation>\n
					<siv:vehicule>\n
						<siv:caracteristiques_techniques>\n
							<siv:marque_vehicule>PEUGEOT</siv:marque_vehicule>\n
							<siv:tvv>USHNSS-R2CD00</siv:tvv>\n
							<siv:cnit>M10PGTVP456S789</siv:cnit>\n
							<siv:denomination_com>2008</siv:denomination_com>\n
							<siv:vin>VF3USHNSSMK123456</siv:vin>\n
							<siv:code_couleur>10</siv:code_couleur>\n
							<siv:libelle_couleur>NOIR</siv:libelle_couleur>\n
							<siv:pt>1740</siv:pt>\n
							<siv:ptac>1740</siv:ptac>\n
							<siv:ptra>2940</siv:ptra>\n
							<siv:pt_service>1280</siv:pt_service>\n
							<siv:ptav>1205</siv:ptav>\n
							<siv:categorie_ce>M1</siv:categorie_ce>\n
							<siv:genre_national>VP</siv:genre_national>\n
							<siv:carrosserie_ce>AF</siv:carrosserie_ce>\n
							<siv:carrosserie_national>BREAK</siv:carrosserie_national>\n
							<siv:num_reception>e2*2007/46*0639*12</siv:num_reception>\n
							<siv:type_reception>CE</siv:type_reception>\n
							<siv:cylindree>1199</siv:cylindree>\n
							<siv:puissance_nette_max>96</siv:puissance_nette_max>\n
							<siv:energie>ES</siv:energie>\n
							<siv:puissance_cv>7</siv:puissance_cv>\n
							<siv:places_assises>5</siv:places_assises>\n
							<siv:niveau_sonore>76</siv:niveau_sonore>\n
							<siv:vitesse>3750</siv:vitesse>\n
							<siv:co2>136</siv:co2>\n
							<siv:classe_environnement_ce>715/2007*2018/1832APEURO6</siv:classe_environnement_ce>\n
						</siv:caracteristiques_techniques>\n
					</siv:vehicule>\n
					<siv:personne>\n
						<siv:nb_cotitulaires>0</siv:nb_cotitulaires>\n
						<siv:liste_personnes>\n
							<siv:personne>\n
								<siv:code_type_personne>TIT</siv:code_type_personne>\n
								<siv:libelle_type_personne>titulaire</siv:libelle_type_personne>\n
								<siv:identite_personne>\n
									<siv:flag_pers_physique>oui</siv:flag_pers_physique>\n
									<siv:nom_naiss>MARTINEZ</siv:nom_naiss>\n
									<siv:prenom>JEAN-PHILIPPE</siv:prenom>\n
									<siv:sexe>M</siv:sexe>\n
									<siv:date_naissance>1975-06-20</siv:date_naissance>\n
									<siv:lieu_naissance>TOULOUSE</siv:lieu_naissance>\n
									<siv:code_dep_naissance>31</siv:code_dep_naissance>\n
									<siv:libelle_dep_naissance>HAUTE-GARONNE</siv:libelle_dep_naissance>\n
									<siv:pays_naissance>FRANCE</siv:pays_naissance>\n
								</siv:identite_personne>\n
								<siv:adresse_personne>\n
									<siv:point_remise>2</siv:point_remise>\n
									<siv:num_voie>42</siv:num_voie>\n
									<siv:type_voie>AVENUE</siv:type_voie>\n
									<siv:libelle_voie>DES CHAMPS</siv:libelle_voie>\n
									<siv:code_postal>31000</siv:code_postal>\n
									<siv:libelle_commune>TOULOUSE</siv:libelle_commune>\n
								</siv:adresse_personne>\n
							</siv:personne>\n
						</siv:liste_personnes>\n
					</siv:personne>\n
				</siv:dossier>\n
			</siv:reponse>\n
		</siv:rep_consulter_dossier>
	</soapenv:Body>
</soapenv:Envelope>"
